{
    "translation": {
        "error": {
            "unrecoverableErrorNull": "Unrecoverable error!! Error is null!",
            "networkError": "Network error",
            "cancelledRequest": "The request was canceled",
            "noResponseReceived": "The request was made but no response was received",
            "failedRequestAndResponse": "Both the request and the response failed to return",
            "httpStatusCodes": {
                "301": "Document moved permanently.",
                "302": "Temporarily moved document",
                "303": "Redirects do not link to the requested resource itself, but to another page",
                "304": "Not modified",
                "305": "The resource requested by the client is only available through a proxy",
                "307": "Temporary redirect",
                "308": "Permanent redirect",
                "400": "The server cannot or will not process the request due to what is perceived to be a client error.",
                "401": "Unauthorized access. Try logging in again!",
                "402": "The request cannot be processed until the customer makes a payment",
                "403": "Access denied",
                "404": "We were unable to find the resource you are looking for. Try again",
                "405": "The target resource does not support the method used",
                "406": "The server cannot produce a response that matches the list of acceptable values ​​defined in the request's proactive content negotiation headers, what's more, the server is unwilling to provide a default representation.",
                "407": "The request was not applied because it does not have valid authentication credentials for a proxy server that is between the app and the server that can access the requested resource.",
                "408": "Wait timeout exceeded!",
                "409": "There was a conflict in the request. Try again!",
                "410": "Access to the target resource is no longer available on the source server and this condition is likely to be permanent.",
                "411": "The server refused to accept the request without a Content-Length header set",
                "412": "Access to the target resource is denied",
                "413": "The request is greater than the limits defined by the server",
                "414": "The URI requested by the client is longer than the server is willing to interpret.",
                "415": "The server refuses to accept the request because the payload format is in an unsupported format",
                "416": "The server cannot service the requested ranges",
                "417": "The expectation provided in the Expect header of the request could not be met.",
                "418": "The server refuses to process the request!",
                "419": "Insufficient space on requested resource",
                "420": "The method failed. Try again",
                "421": "The request was directed to a server that is unable to produce a response",
                "422": "The request was well worded but could not be followed up due to errors in the form.",
                "423": "Feature blocked",
                "424": "The request failed due to a previous request failing!",
                "428": "The origin server requires the request to be conditional!",
                "429": "Keep calm. You are sending too many requests to the server!",
                "431": "The server is unwilling to process the request because its header fields are too large",
                "451": "The user agent has requested a feature that cannot legally be provided.",
                "500": "Internal server error",
                "501": "The request method is not supported by the server and cannot be handled.",
                "502": "The server, while working as a gateway to get a response needed to handle the request, got an invalid response.",
                "503": "Service currently unavailable",
                "504": "The server is acting as a gateway and cannot get a response in time.",
                "505": "The HTTP version used in the request is not supported by the server.",
                "507": "Insufficient server storage",
                "511": "The client needs to authenticate to gain access to the network."
            }
        }
    }
}
