{
    "translation": {
        "error": {
            "generic": "A operação não pôde ser processada neste momento. Por favor, tente novamente mais tarde.",
            "unrecoverableErrorNull": "Erro irreversível! O erro é nulo!",
            "networkError": "Erro de rede",
            "cancelledRequest": "A solicitação foi cancelada",
            "noResponseReceived": "A solicitação foi feita, mas nenhuma resposta foi recebida",
            "failedRequestAndResponse": "Tanto a solicitação quanto a resposta falharam em retornar",
            "httpStatusCodes": {
                "301": "Documento movido permanentemente.",
                "302": "Documento movido temporariamente",
                "303": "Redirecionamentos não linkam para o recurso solicitado em si, mas para outra página",
                "304": "Não modificado",
                "305": "O recurso solicitado pelo cliente só está disponível através de um proxy",
                "307": "Redirecionamento temporário",
                "308": "Redirecionamento permanente",
                "400": "O servidor não pode ou não processará a solicitação devido ao que é percebido como um erro do cliente.",
                "401": "Acesso não autorizado. Tente fazer login novamente!",
                "402": "A solicitação não pode ser processada até que o cliente faça um pagamento",
                "403": "Acesso negado",
                "404": "Não conseguimos encontrar o recurso que você está procurando. Tente novamente",
                "405": "O recurso de destino não suporta o método usado",
                "406": "O servidor não pode produzir uma resposta que corresponda à lista de valores aceitáveis ​​definidos nos cabeçalhos de negociação de conteúdo proativo da solicitação, além disso, o servidor não está disposto a fornecer uma representação padrão.",
                "407": "A solicitação não foi aplicada porque não possui credenciais de autenticação válidas para um servidor proxy que está entre o aplicativo e o servidor que pode acessar o recurso solicitado.",
                "408": "Excedido o tempo limite de espera!",
                "409": "Houve um conflito na solicitação. Tente novamente!",
                "410": "O acesso ao recurso de destino não está mais disponível no servidor de origem e essa condição provavelmente é permanente.",
                "411": "O servidor recusou-se a aceitar a solicitação sem um cabeçalho Content-Length definido",
                "412": "O acesso ao recurso de destino é negado",
                "413": "A solicitação é maior do que os limites definidos pelo servidor",
                "414": "O URI solicitado pelo cliente é mais longo do que o servidor está disposto a interpretar.",
                "415": "O servidor se recusa a aceitar a solicitação porque o formato de carga útil está em um formato não suportado",
                "416": "O servidor não pode atender as faixas solicitadas",
                "417": "A expectativa fornecida no cabeçalho Expect da solicitação não pôde ser atendida.",
                "418": "O servidor se recusa a processar a solicitação!",
                "419": "Espaço insuficiente no recurso solicitado",
                "420": "O método falhou. Tente novamente",
                "421": "A solicitação foi direcionada para um servidor que é incapaz de produzir uma resposta",
                "422": "A solicitação foi bem formulada, mas não pôde ser seguida devido a erros no formulário.",
                "423": "Recurso bloqueado",
                "424": "A solicitação falhou devido a uma solicitação anterior com falha!",
                "428": "O servidor de origem requer que a solicitação seja condicional!",
                "429": "Fique calmo. Você está enviando muitas solicitações para o servidor!",
                "431": "O servidor não está disposto a processar a solicitação porque os campos do cabeçalho são muito grandes",
                "451": "O agente do usuário solicitou um recurso que não pode ser legalmente fornecido.",
                "500": "Erro interno do servidor",
                "501": "O método de solicitação não é suportado pelo servidor e não pode ser manipulado.",
                "502": "O servidor, enquanto trabalhava como gateway para obter uma resposta necessária para manipular a solicitação, recebeu uma resposta inválida.",
                "503": "Serviço indisponível no momento",
                "504": "O servidor está agindo como gateway e não pode obter uma resposta a tempo.",
                "505": "A versão HTTP usada na solicitação não é suportada pelo servidor.",
                "507": "Armazenamento insuficiente no servidor",
                "511": "O cliente precisa se autenticar para obter acesso à rede."
            }
        }
    }
}
